Show / Hide Table of Contents
Class Vector3D
Represents a vector in three-dimensional space.
Inheritance
System.Object
OpenObject
Vector3D
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Geometry3D
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.Geometry3D.Vector3D,CI.BasicTypes")]
[DataContract]
public class Vector3D : OpenObject
Properties
Improve this Doc   View Source
X
Gets or sets the X-dirrection value
Declaration
[OpenModelProperty("DirectionX")]
[DataMember]
public double X { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Y
Gets or sets the Y-dirrection value
Declaration
[OpenModelProperty("DirectionY")]
[DataMember]
public double Y { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Z
Gets or sets the Z-dirrection value
Declaration
[OpenModelProperty("DirectionZ")]
[DataMember]
public double Z { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source